/**
 * Simplified Chinese translation for simple-validate
 */
;(function ($) {
    $.simplevalidate.i18nMessages = {
        required : "[{0}]不能为空!",
        alpha : "[{0}]输入错误!只能输入字母!",
        num : "[{0}]输入错误!只能输入数字!",
        alphanum : "[{0}]输入错误!只能输入数字和字母!",
        len : ["[{0}]输入错误!只能输入{1}位字符!", "[{0}]输入错误!只能输入{1}位以上字符!", "[{0}]输入错误!只能输入{1}位以下字符!", "[{0}]输入错误!只能输入{1}-{2}位字符!"],
        numeric : ["[{0}]输入错误!只能输入{1}位以内整数!", "[{0}]输入错误!只能输入{1}位以内整数{2}位以内小数!"],
        range : ["[{0}]输入错误!只能输入大于{1}的值!", "[{0}]输入错误!只能输入小于{1}的值!", "[{0}]输入错误!只能输入{1}-{2}之间的值!"],
        regex : "[{0}]输入错误!格式错误!",
        inclusion : "[{0}]输入错误!只能输入指定内容!",
        awb : "[{0}]输入错误!运单号应为11位数字，前3位前缀，后8位符合模7校验!",
        apt : "[{0}]输入错误!只能输入3位字母!",
        pcs : "[{0}]输入错误!只能输入5位以内数字!",
        wgt : "[{0}]输入错误!只能输入8位以内整数4位以内小数!"
    };
}(jQuery));